#### 06 - Pandas Series and Index Objects

##### First steps

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\titanic.csv")
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [ ]:
# And actually a Pandas series is a one dimensional labeled array.
# titanic.age
titanic["age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [ ]:
# Dataframes and Pandas series share most of the methods and attributes.
age = titanic["age"]

In [ ]:
age.head(), age.tail(), age.dtype, age.shape, age.index, type(age)

(0    22.0
 1    38.0
 2    26.0
 3    35.0
 4    35.0
 Name: age, dtype: float64,
 886    27.0
 887    19.0
 888     NaN
 889    26.0
 890    32.0
 Name: age, dtype: float64,
 dtype('float64'),
 (891,),
 RangeIndex(start=0, stop=891, step=1),
 pandas.core.series.Series)

In [ ]:
age.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: age
Non-Null Count  Dtype
--------------  -----
714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [ ]:
# convert the series to a pandas dataframe
age.to_frame()

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [ ]:
age.to_frame().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

##### Analyzing Numerical Series with unique(), nunique() and value_counts()

In [ ]:
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [ ]:
# ******************************************************************************************
# count the number of non-missing values
# sum(age) does not know how to handle missing values but age.sum() does (it has a parameter skipna to handle missing values)
# .unique() returns an array of unique values (remove duplicates)(missing values are included)
# .nunique() returns the number of unique values (missing values are excluded) (dropna=True by default)
# ******************************************************************************************
age.count(), age.size, len(age), age.sum(), age.sum(skipna=False), sum(age), age.mean(), age.min(), age.max(), 
age.median(), age.std(), age.unique(), len(age.unique()), age.nunique(), age.nunique(dropna=False)

(np.float64(28.0),
 np.float64(14.526497332334042),
 array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
         4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
         8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
        49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
        16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
        71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
        51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
        45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
        60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
        70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ]),
 89,
 88,
 89)

In [ ]:
# ******************************************************************************************
# value_counts() returns the frequency of each unique value in the series
# ******************************************************************************************
# The value Counts method is a very useful and versatile method, and the default behavior is that it
# returns the number of occurrences or to say the absolute frequencies of all unique values sorted from most frequent to least frequent.
age.value_counts()

age
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
24.50     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [ ]:
# sort False will return the unique values in the order they appear in the series
age.value_counts(sort=False)

age
22.00     27
38.00     11
26.00     18
35.00     18
NaN      177
        ...
0.67       1
30.50      2
0.42       1
34.50      1
74.00      1
Name: count, Length: 89, dtype: int64

In [ ]:
age.value_counts(dropna=False)

age
NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
24.50      1
0.67       1
0.42       1
34.50      1
74.00      1
Name: count, Length: 89, dtype: int64

In [ ]:
# low to high in frequency
age.value_counts(ascending=True)

age
66.0     1
12.0     1
70.5     1
36.5     1
20.5     1
        ..
28.0    25
30.0    25
18.0    26
22.0    27
24.0    30
Name: count, Length: 88, dtype: int64

In [ ]:
# And actually, by default, Pandas returns the absolute frequencies.
# normalize parameter to return the relative frequencies - by default it is set to False - so we get the absolute frequencies.
# ******************************************************************************************
# But we have also the option to return the relative frequencies.
# So to say 4.5% of all passengers are 24 years old and 3.7% of all passengers are 22 years old and so on.
# ******************************************************************************************
age.value_counts(normalize=False), age.value_counts(normalize=True)

(age
 24.00    30
 22.00    27
 18.00    26
 28.00    25
 30.00    25
          ..
 24.50     1
 0.67      1
 0.42      1
 34.50     1
 74.00     1
 Name: count, Length: 88, dtype: int64,
 age
 24.00    0.042017
 22.00    0.037815
 18.00    0.036415
 28.00    0.035014
 30.00    0.035014
            ...
 24.50    0.001401
 0.67     0.001401
 0.42     0.001401
 34.50    0.001401
 74.00    0.001401
 Name: proportion, Length: 88, dtype: float64)

In [ ]:
# Now the question is, how does pandas calculate the relative frequencies?
# ******************************************************************************************
# 30 / the number of non-missing values. (714 in de denominator because we have 714 non-missing values in the age column)
# we set the dropna parameter to False to include the missing values in the denominator.
# so in the denominator, we have 714 + 177 = 891, so we have the total number of elements in the series.
# ******************************************************************************************
age.value_counts(dropna=False, normalize=True), (30 / age.count()), (30 / age.size), (30 / len(age))

(age
 NaN      0.198653
 24.00    0.033670
 22.00    0.030303
 18.00    0.029181
 28.00    0.028058
            ...
 24.50    0.001122
 0.67     0.001122
 0.42     0.001122
 34.50    0.001122
 74.00    0.001122
 Name: proportion, Length: 89, dtype: float64,
 np.float64(0.04201680672268908),
 0.03367003367003367,
 0.03367003367003367)

In [ ]:
# bins parameter to group the unique values into half open intervals
# ******************************************************************************************
# So we have bins and here we can group the unique values into half open equal width bins.
# ******************************************************************************************
# include sort parameter to sort the bins by the index
age.value_counts(dropna=False, normalize=True, bins=5, sort=False)

(0.339, 16.336]     0.112233
(16.336, 32.252]    0.388328
(32.252, 48.168]    0.210999
(48.168, 64.084]    0.077441
(64.084, 80.0]      0.012346
Name: proportion, dtype: float64

In [ ]:
# normalize parameter to False to return the absolute frequencies
# ******************************************************************************************
age.value_counts(dropna=False, normalize=False, bins=5, sort=False)

(0.339, 16.336]     100
(16.336, 32.252]    346
(32.252, 48.168]    188
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: count, dtype: int64

In [ ]:
fare = titanic["fare"]
fare.value_counts(ascending=False)

fare
8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
13.8583     1
50.4958     1
5.0000      1
9.8458      1
10.5167     1
Name: count, Length: 248, dtype: int64

In [ ]:
# Use value_counts() on the column "fare" and then select the first element in the Index.
print(fare.value_counts(ascending=False).idxmax()), print(fare.value_counts(ascending=False).max()),
print(fare.value_counts(ascending=True).idxmin()), print(fare.value_counts(ascending=True).min())

8.05
43
71.2833
1

(None, None)

##### Analyzing NON-numerical Series with unique(), nunique(), value_counts()

In [ ]:
import pandas as pd
summer = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\summer.csv")
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [ ]:
athlete = summer["Athlete"]
athlete.head(), type(athlete)

(0         HAJOS, Alfred
 1      HERSCHMANN, Otto
 2     DRIVAS, Dimitrios
 3    MALOKINIS, Ioannis
 4    CHASAPIS, Spiridon
 Name: Athlete, dtype: object,
 pandas.core.series.Series)

In [ ]:
athlete.dtypes, athlete.size, athlete.count(), athlete.shape, athlete.index

(dtype('O'),
 31165,
 np.int64(31165),
 (31165,),
 RangeIndex(start=0, stop=31165, step=1))

In [ ]:
athlete.describe()

count               31165
unique              22762
top       PHELPS, Michael
freq                   22
Name: Athlete, dtype: object

In [ ]:
# alphabetically sorted
# ******************************************************************************************
# athlete.unique(), len(athlete.unique()), athlete.nunique() - check the difference between unique and nunique
# ******************************************************************************************
athlete.min(), athlete.max(), athlete.unique(), len(athlete.unique()), athlete.nunique()

('AABYE, Edgar',
 'Ã–STRAND, Per-Olof',
 array(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios', ...,
        'TOTROV, Rustam', 'ALEKSANYAN, Artur', 'LIDBERG, Jimmy'],
       dtype=object),
 22762,
 22762)

In [ ]:
athlete.value_counts()

Athlete
PHELPS, Michael             22
LATYNINA, Larisa            18
ANDRIANOV, Nikolay          15
ONO, Takashi                13
MANGIAROTTI, Edoardo        13
                            ..
UNDA, Maider                 1
BURROUGHS, Jordan Ernest     1
GOUDARZI, Sadegh Saeed       1
HATOS, Gabor                 1
TSARGUSH, Denis              1
Name: count, Length: 22762, dtype: int64

In [ ]:
athlete.value_counts(sort=True, ascending=True)

Athlete
TANATAROV, Akzhurek          1
VOROBIEVA, Natalia           1
HRISTOVA, Stanka Zlateva     1
MANYUROVA, Guzel             1
UNDA, Maider                 1
                            ..
MANGIAROTTI, Edoardo        13
ONO, Takashi                13
ANDRIANOV, Nikolay          15
LATYNINA, Larisa            18
PHELPS, Michael             22
Name: count, Length: 22762, dtype: int64

In [ ]:
# Phelps, Michael has the most medals - 22/31165 = 0.0007069104
# ******************************************************************************************
athlete.value_counts(sort=True, ascending=False, normalize=True).head()

Athlete
PHELPS, Michael         0.000706
LATYNINA, Larisa        0.000578
ANDRIANOV, Nikolay      0.000481
ONO, Takashi            0.000417
MANGIAROTTI, Edoardo    0.000417
Name: proportion, dtype: float64

##### Creating Pandas Series (Part 1)

In [ ]:
import pandas as pd

In [ ]:
# ******************************************************************************************
# from dataframe
# ******************************************************************************************
summer = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\summer.csv")
summer.Athlete

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [ ]:
summer.iloc[0]

Year                    1896
City                  Athens
Sport               Aquatics
Discipline          Swimming
Athlete        HAJOS, Alfred
Country                  HUN
Gender                   Men
Event         100M Freestyle
Medal                   Gold
Name: 0, dtype: object

In [ ]:
# ******************************************************************************************
# importing from csv
# ******************************************************************************************
# .squeeze() will return a series if there is only one column
pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\summer.csv", usecols=["Athlete"]).squeeze()

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [ ]:
# ******************************************************************************************
# creating from scratch with pd.Series()
# ******************************************************************************************
pd.Series([10,25,6,36,2])

0    10
1    25
2     6
3    36
4     2
dtype: int64

In [ ]:
pd.Series([10,25,6,36,2], index=["Mon", "Tue", "Wed", "Thu", "Fri"])

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [ ]:
# give it a name
pd.Series([10,25,6,36,2], index=["Mon", "Tue", "Wed", "Thu", "Fri"], name="Sales")

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
Name: Sales, dtype: int64

##### Creating Pandas Series (Part 2)

In [ ]:
# ******************************************************************************************
# from numpy array
# ******************************************************************************************
import pandas as pd
import numpy as np
sales = np.array([10,25,6,36,2])
sales

array([10, 25,  6, 36,  2])

In [ ]:
pd.Series(sales)

0    10
1    25
2     6
3    36
4     2
dtype: int64

In [ ]:
# ******************************************************************************************
# from a list, tuple ...
# ******************************************************************************************
sales = [10,25,6,36,2]
pd.Series(sales,index=["Mon", "Tue", "Wed", "Thu", "Fri"], name="Sales")

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
Name: Sales, dtype: int64

In [ ]:
# ******************************************************************************************
# from a dictionary
# keys will be the index labels and values will be the data
# ******************************************************************************************
dic = {"Mon":10, "Tue":25, "Wed":6, "Thu":36, "Fri":2}
sales = pd.Series(dic)
sales

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [ ]:
# conflict between the dictionary keys and the index parameter
# ******************************************************************************************
# And what Python or Pandas actually does. It compares our new index to the keys of our dictionary. And where we have the same label.
# So for example, Friday. So Friday is now a new index and also now a dictionary. And on Friday, we had a sales of 2.
# ******************************************************************************************
# So now what happened with the new labels Saturday and Sunday, which were not originally in our dictionary?
# And we have Saturday and Sunday as index labels and our new Panda series. But we get here missing values or Nan values because in our dictionary there is no Saturday and Sunday, no values for it.
# ******************************************************************************************
# Thrusday is in the dictionary, but it is not in the index parameter. So we have a conflict here.
# ******************************************************************************************
pd.Series(dic, index=["Fri", "Sat", "Sun", "Mon", "Tue", "Wed"])

Fri     2.0
Sat     NaN
Sun     NaN
Mon    10.0
Tue    25.0
Wed     6.0
dtype: float64

In [ ]:
pd.Series(dic, index=[1,2,3,4,5])

1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

##### Indexing and Slicing Pandas Series

In [ ]:
import pandas as pd
titanic = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\titanic.csv")
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [ ]:
age = titanic["age"]
age.head(), age.tail(), age.index

(0    22.0
 1    38.0
 2    26.0
 3    35.0
 4    35.0
 Name: age, dtype: float64,
 886    27.0
 887    19.0
 888     NaN
 889    26.0
 890    32.0
 Name: age, dtype: float64,
 RangeIndex(start=0, stop=891, step=1))

In [ ]:
# ******************************************************************************************
# And with a range index, we do not really know if we are doing now position based indexing or label based indexing because the range index labels are identical to the position.
# ******************************************************************************************
# age[-1] - ValueError: -1 is not in range - we cannot use negative values with a range index - we use iloc instead
# ******************************************************************************************
age[0], age[1], age[2], age[3], age[4], age.iloc[-1], age.iloc[-2], age.iloc[-3]

(np.float64(22.0),
 np.float64(38.0),
 np.float64(26.0),
 np.float64(35.0),
 np.float64(35.0),
 np.float64(32.0),
 np.float64(26.0),
 np.float64(nan))

In [ ]:
# So here now slicing with spare brackets behaves like position based indexing and before with the -1. It didn't behave like position based indexing.
age[[3,4]], age[:3]

(3    35.0
 4    35.0
 Name: age, dtype: float64,
 0    22.0
 1    38.0
 2    26.0
 Name: age, dtype: float64)

In [ ]:
# ******************************************************************************************
# The most appropriate behavior is to use the loc method for label based indexing and the iloc method for position based indexing.
# ******************************************************************************************

In [ ]:
summer = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\summer.csv", index_col="Athlete")
summer.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
event = summer["Event"]

In [ ]:
event.head(), "\n", event.tail()

(Athlete
 HAJOS, Alfred                     100M Freestyle
 HERSCHMANN, Otto                  100M Freestyle
 DRIVAS, Dimitrios     100M Freestyle For Sailors
 MALOKINIS, Ioannis    100M Freestyle For Sailors
 CHASAPIS, Spiridon    100M Freestyle For Sailors
 Name: Event, dtype: object,
 '\n',
 Athlete
 JANIKOWSKI, Damian           Wg 84 KG
 REZAEI, Ghasem Gholamreza    Wg 96 KG
 TOTROV, Rustam               Wg 96 KG
 ALEKSANYAN, Artur            Wg 96 KG
 LIDBERG, Jimmy               Wg 96 KG
 Name: Event, dtype: object)

In [ ]:
event.index

Index(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios',
       'MALOKINIS, Ioannis', 'CHASAPIS, Spiridon', 'CHOROPHAS, Efstathios',
       'HAJOS, Alfred', 'ANDREOU, Joannis', 'CHOROPHAS, Efstathios',
       'NEUMANN, Paul',
       ...
       'AHMADOV, Emin', 'KAZAKEVIC, Aleksandr', 'KHUGAEV, Alan',
       'EBRAHIM, Karam Mohamed Gaber', 'GAJIYEV, Danyal', 'JANIKOWSKI, Damian',
       'REZAEI, Ghasem Gholamreza', 'TOTROV, Rustam', 'ALEKSANYAN, Artur',
       'LIDBERG, Jimmy'],
      dtype='object', name='Athlete', length=31165)

In [ ]:
# And now here the position based indexing with minus one works, because here in this case, we have a index that is not a range index and Python knows exactly that we want to do here, position based indexing.
# deprecated - event[0], event[-1]
event.iloc[0], event.iloc[-1]

('100M Freestyle', 'Wg 96 KG')

In [ ]:
event.iloc[:3]

Athlete
HAJOS, Alfred                    100M Freestyle
HERSCHMANN, Otto                 100M Freestyle
DRIVAS, Dimitrios    100M Freestyle For Sailors
Name: Event, dtype: object

In [ ]:
event["DRIVAS, Dimitrios"]

'100M Freestyle For Sailors'

In [ ]:
event[:"DRIVAS, Dimitrios"]

Athlete
HAJOS, Alfred                    100M Freestyle
HERSCHMANN, Otto                 100M Freestyle
DRIVAS, Dimitrios    100M Freestyle For Sailors
Name: Event, dtype: object

In [ ]:
event.loc["PHELPS, Michael"]

Athlete
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael            200M Freestyle
PHELPS, Michael    200M Individual Medley
PHELPS, Michael    400M Individual Medley
PHELPS, Michael    4X100M Freestyle Relay
PHELPS, Michael       4X100M Medley Relay
PHELPS, Michael    4X200M Freestyle Relay
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael            200M Freestyle
PHELPS, Michael    200M Individual Medley
PHELPS, Michael    400M Individual Medley
PHELPS, Michael    4X100M Freestyle Relay
PHELPS, Michael       4X100M Medley Relay
PHELPS, Michael    4X200M Freestyle Relay
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael               200M Medley
PHELPS, Michael          4X100M Freestyle
PHELPS, Michael             4X100M Medley
PHELPS, Michael          4X200M Freestyle
Name: Event, dtype: object

In [ ]:
event.loc["PHELPS, Michael"].equals(event["PHELPS, Michael"])

True

In [ ]:
event.loc[["PHELPS, Michael","LEWIS, Carl"]]

Athlete
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael            200M Freestyle
PHELPS, Michael    200M Individual Medley
PHELPS, Michael    400M Individual Medley
PHELPS, Michael    4X100M Freestyle Relay
PHELPS, Michael       4X100M Medley Relay
PHELPS, Michael    4X200M Freestyle Relay
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael            200M Freestyle
PHELPS, Michael    200M Individual Medley
PHELPS, Michael    400M Individual Medley
PHELPS, Michael    4X100M Freestyle Relay
PHELPS, Michael       4X100M Medley Relay
PHELPS, Michael    4X200M Freestyle Relay
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael               200M Medley
PHELPS, Michael          4X100M Freestyle
PHELPS, Michael             4X100M Medley
PHELPS, Michael          4X200M Freestyle
LEWIS, Carl                          100M
LEWIS, Carl                          200M
LEWIS, Carl                  4X100M Relay
LEWIS, Carl                     Long Jump
LEWIS, Carl                          100M
LEWIS, Carl                          200M
LEWIS, Carl                     Long Jump
LEWIS, Carl                  4X100M Relay
LEWIS, Carl                     Long Jump
LEWIS, Carl                     Long Jump
Name: Event, dtype: object

##### Sorting of Series and Introduction to the inplace - parameter

In [ ]:
import pandas as pd

In [ ]:
# ******************************************************************************************
# we can sort pandas series by the index or by the values
# ******************************************************************************************

In [ ]:
# monday yo sunday sales
dic = {1:10, 3:25, 2:6, 4:36, 5:2, 6:0, 7:None}
sales = pd.Series(dic)
sales

1    10.0
3    25.0
2     6.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [ ]:
# sort by index
# ******************************************************************************************
# inplace parameter here also, check sort by index to know the impact of inplace parameter
# ******************************************************************************************
sales.sort_index(), sales.sort_index(ascending=False)

(1    10.0
 2     6.0
 3    25.0
 4    36.0
 5     2.0
 6     0.0
 7     NaN
 dtype: float64,
 7     NaN
 6     0.0
 5     2.0
 4    36.0
 3    25.0
 2     6.0
 1    10.0
 dtype: float64)

In [ ]:
sales

1    10.0
3    25.0
2     6.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [ ]:
# sort by values
# ******************************************************************************************
# by default, the missing values are placed at the end of the series
# ******************************************************************************************
# inplace parameter to sort the series in place
# inplace = False by default - it returns a new series with the sorted values (the original series remains unchanged)
# inplace = True - it sorts the series in place and returns None
# ******************************************************************************************
sales.sort_values(), sales.sort_values(ascending=False, inplace=False)

(6     0.0
 5     2.0
 2     6.0
 1    10.0
 3    25.0
 4    36.0
 7     NaN
 dtype: float64,
 4    36.0
 3    25.0
 1    10.0
 2     6.0
 5     2.0
 6     0.0
 7     NaN
 dtype: float64)

In [ ]:
sales

1    10.0
3    25.0
2     6.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [ ]:
# ******************************************************************************************
# inplace = True will modify the original series
# ******************************************************************************************
sales.sort_values()

6     0.0
5     2.0
2     6.0
1    10.0
3    25.0
4    36.0
7     NaN
dtype: float64

In [ ]:
sales

1    10.0
3    25.0
2     6.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [ ]:
sales.sort_values(ascending=False, inplace=True)

In [ ]:
# inplace = True has modified the original series
sales

4    36.0
3    25.0
1    10.0
2     6.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [ ]:
# ******************************************************************************************
# change nan position - na_position parameter to change the position of the missing values
# ******************************************************************************************
# na_position = 'first' - missing values are placed at the beginning of the series
# na_position = 'last' - missing values are placed at the end of the series
# ******************************************************************************************
sales.sort_values(na_position='first')

7     NaN
6     0.0
5     2.0
2     6.0
1    10.0
3    25.0
4    36.0
dtype: float64

In [ ]:
sales

4    36.0
3    25.0
1    10.0
2     6.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [ ]:
dic = {"Monday":10, "Tuesday":25, "Wednesday":6, "Thursday":36, "Friday":2, "Saturday":0, "Sunday":None}
sales = pd.Series(dic)
sales

Monday       10.0
Tuesday      25.0
Wednesday     6.0
Thursday     36.0
Friday        2.0
Saturday      0.0
Sunday        NaN
dtype: float64

In [ ]:
# sort by index
# ******************************************************************************************
# in this case the index is a string and the sorting is done alphabetically
# ******************************************************************************************
sales.sort_index(ascending=True)

Friday        2.0
Monday       10.0
Saturday      0.0
Sunday        NaN
Thursday     36.0
Tuesday      25.0
Wednesday     6.0
dtype: float64

##### nlargest() and nsmallest()

In [ ]:
import pandas as pd
titanic = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\titanic.csv")
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [ ]:
age = titanic["age"]
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
# from oldest passenger to youngest passenger
age.sort_values(ascending=False).head(3)

630    80.0
851    74.0
493    71.0
Name: age, dtype: float64

In [ ]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [ ]:
# age.sort_values(ascending=False).head(3)
age.nlargest(3)

630    80.0
851    74.0
96     71.0
Name: age, dtype: float64

In [ ]:
age.sort_values(ascending=True).head(3)

803    0.42
755    0.67
469    0.75
Name: age, dtype: float64

In [ ]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [ ]:
# age.sort_values(ascending=True).head(3)
# age.sort_values(ascending=True).iloc[:3]
age.nsmallest(3)

803    0.42
755    0.67
469    0.75
Name: age, dtype: float64

In [ ]:
# ******************************************************************************************
# sort the series by the values and then get the index of the 3 smallest values
# ******************************************************************************************
age.nsmallest(3).index

Index([803, 755, 469], dtype='int64')

In [ ]:
age.nsmallest(3).index[0], age.nsmallest(3).index.to_list()

(np.int64(803), [803, 755, 469])

##### idxmin() and idxmax()

In [ ]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [ ]:
# ******************************************************************************************
# extracting the index label
# if we are interesting in the index label of the maximum and minimum value
# ******************************************************************************************
titanic.age.idxmax(), titanic.age.idxmin()

(630, 803)

In [ ]:
# ******************************************************************************************
# extract the complete passenger information by that index label
# ******************************************************************************************
titanic.loc[titanic.age.idxmax()]

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object

In [ ]:
dic = {"Monday":10, "Tuesday":25, "Wednesday":6, "Thursday":36, "Friday":2, "Saturday":0, "Sunday":None}
sales = pd.Series(dic)
sales

Monday       10.0
Tuesday      25.0
Wednesday     6.0
Thursday     36.0
Friday        2.0
Saturday      0.0
Sunday        NaN
dtype: float64

In [ ]:
sales.sort_values(ascending=True).index[0], sales.idxmin()

('Saturday', 'Saturday')

In [ ]:
sales.sort_values(ascending=False).index[0], sales.idxmax()

('Thursday', 'Thursday')

##### Manipulating Pandas Series

In [ ]:
import pandas as pd
sales = pd.Series([10,25,6,36,2,0,None,5], index=["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun", "Mon"])
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     NaN
Mon     5.0
dtype: float64

In [ ]:
sales["Sun"] = 0
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     0.0
Mon     5.0
dtype: float64

In [ ]:
sales.iloc[3] = 30
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    30.0
Fri     2.0
Sat     0.0
Sun     0.0
Mon     5.0
dtype: float64

In [ ]:
# transform the series into a euro currency
# ******************************************************************************************
# So with lists we would need here A for loop and iterate over all elements and change each single element.
# But here with Pandas series, we can actually perform this in a vectorized manner and we can simply divide here our sales Pandas series by 1.1.
# ******************************************************************************************
(sales * 0.9).round(2)

Mon     9.0
Tue    22.5
Wed     5.4
Thu    27.0
Fri     1.8
Sat     0.0
Sun     0.0
Mon     4.5
dtype: float64

In [ ]:
sales_EUR = (sales * 0.9).round(2)

In [ ]:
# duplicate index values - change the value for all occurrences of the index label
# ******************************************************************************************
sales_EUR["Mon"]= 0
sales_EUR

Mon     0.0
Tue    22.5
Wed     5.4
Thu    27.0
Fri     1.8
Sat     0.0
Sun     0.0
Mon     0.0
dtype: float64

In [ ]:
import pandas as pd
titanic = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\titanic.csv")
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [ ]:
age = titanic["age"]
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
age.iloc[1] = 30

C:\Users\aitor\AppData\Local\Temp\ipykernel_12968\1477452854.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  age.iloc[1] = 30

In [ ]:
age.head()

0    22.0
1    30.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
# So we also have overridden the value here in our original data frame. !!!!!!!!!
# ******************************************************************************************
# So what we actually did, we actually sliced our data frame for the age column and then we changed a value in our age column.
# But we have also changed this value in our original data frame.
# ******************************************************************************************
# So we have to be careful when we use the bracket notation for assignment in Pandas series or data frames.
# pandas sent us a warning here that we have actually changed the original data frame.
# ******************************************************************************************
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  30.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

##### First Steps with Pandas Index Objects

In [ ]:
import pandas as pd
summer = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\summer.csv")
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
# index object
summer.index, type(summer.index)

(RangeIndex(start=0, stop=31165, step=1), pandas.core.indexes.range.RangeIndex)

In [ ]:
# And it's a index object here. And actually here it looks a bit like an list or an array.
# However, compared to a list or an array, the index object or index data type has a special methods 
# and attributes specifically designed for large datasets.
# ******************************************************************************************
# And actually the index object is a very powerful and versatile object in Pandas.
# So with index objects, you can do much more than, for example, with a list.
# And that's why developers of Pandas created the index object to allow special index operations.
# ******************************************************************************************
summer.columns, type(summer.columns)

(Index(['Year', 'City', 'Sport', 'Discipline', 'Athlete', 'Country', 'Gender',
        'Event', 'Medal'],
       dtype='object'),
 pandas.core.indexes.base.Index)

In [ ]:
# .axes attribute - returns a list of the row and column axis labels
# ******************************************************************************************
summer.axes

[RangeIndex(start=0, stop=31165, step=1),
 Index(['Year', 'City', 'Sport', 'Discipline', 'Athlete', 'Country', 'Gender',
        'Event', 'Medal'],
       dtype='object')]

In [ ]:
# we have already learned how we can specify the index column when we read in a CSV file.
# ******************************************************************************************
summer = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\summer.csv", index_col="Athlete")
summer.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
Index: 31165 entries, HAJOS, Alfred to LIDBERG, Jimmy
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Country     31161 non-null  object
 5   Gender      31165 non-null  object
 6   Event       31165 non-null  object
 7   Medal       31165 non-null  object
dtypes: int64(1), object(7)
memory usage: 2.1+ MB

In [ ]:
summer.index

Index(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios',
       'MALOKINIS, Ioannis', 'CHASAPIS, Spiridon', 'CHOROPHAS, Efstathios',
       'HAJOS, Alfred', 'ANDREOU, Joannis', 'CHOROPHAS, Efstathios',
       'NEUMANN, Paul',
       ...
       'AHMADOV, Emin', 'KAZAKEVIC, Aleksandr', 'KHUGAEV, Alan',
       'EBRAHIM, Karam Mohamed Gaber', 'GAJIYEV, Danyal', 'JANIKOWSKI, Damian',
       'REZAEI, Ghasem Gholamreza', 'TOTROV, Rustam', 'ALEKSANYAN, Artur',
       'LIDBERG, Jimmy'],
      dtype='object', name='Athlete', length=31165)

In [ ]:
# And also with index objects, we can select and slice single and multiple elements of the index object.
# ******************************************************************************************
# So we can use the bracket notation to select single elements or multiple elements of the index object.
# ******************************************************************************************
# So this is position based indexing with all the rules of zero based indexing.
# ******************************************************************************************
summer.index[:3]

Index(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios'], dtype='object', name='Athlete')

In [ ]:
summer.index[-1]

'LIDBERG, Jimmy'

In [ ]:
# transform the index object into a list
# ******************************************************************************************
summer.columns.tolist()

['Year', 'City', 'Sport', 'Discipline', 'Country', 'Gender', 'Event', 'Medal']

In [ ]:
# atrribute is_unique - returns True if the index has unique values
# ******************************************************************************************
# really important to know if the index has unique values or not because many Pandas methods and attributes depend on unique index values.
# ******************************************************************************************
summer.index.is_unique

False

In [ ]:
# value_counts() - returns the frequency of each unique value in the index
# ******************************************************************************************
summer.index.value_counts()

Athlete
PHELPS, Michael             22
LATYNINA, Larisa            18
ANDRIANOV, Nikolay          15
ONO, Takashi                13
MANGIAROTTI, Edoardo        13
                            ..
UNDA, Maider                 1
BURROUGHS, Jordan Ernest     1
GOUDARZI, Sadegh Saeed       1
HATOS, Gabor                 1
TSARGUSH, Denis              1
Name: count, Length: 22762, dtype: int64

In [ ]:
# attribute nlevels - returns the number of levels in the index
# ******************************************************************************************
# actually, we have only one level in our index object.
# ******************************************************************************************
summer.index.nlevels

1

In [ ]:
# get_loc() method - returns the position of the index label
# ******************************************************************************************
# we can see the difference between a duplicate index label and a non-duplicate index label.
# ******************************************************************************************
summer.index.get_loc("PHELPS, Michael"), summer.index.get_loc("DRIVAS, Dimitrios")

(array([False, False, False, ..., False, False, False]), 2)

##### Creating Index Objects from Scratch

In [ ]:
import pandas as pd
list_1 = [1,2,3]
list_2 = ["a","b","c"]

In [ ]:
pd.Index(list_1), pd.Index(list_2)

(Index([1, 2, 3], dtype='int64'), Index(['a', 'b', 'c'], dtype='object'))

In [ ]:
index_1 = pd.Index(range(1,6))
index_1

RangeIndex(start=1, stop=6, step=1)

In [ ]:
index_2 = pd.Index(["Mon", "Tue", "Wed", "Thu", "Fri"], name="days")
index_2

Index(['Mon', 'Tue', 'Wed', 'Thu', 'Fri'], dtype='object', name='days')

In [ ]:
# we can pass the index object to the index parameter when creating a series
# ******************************************************************************************
pd.Series([10,25,6,36,2], index=index_2)

days
Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [ ]:
# if the number of index labels does not match the number of data elements, we get a ValueError
# ******************************************************************************************
pd.Series([10,25,6,36,2], index=index_1)

1    10
2    25
3     6
4    36
5     2
dtype: int64

##### Changing Row Index with set_index() and reset_index()

In [ ]:
import pandas as pd
summer = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\summer.csv", index_col="Athlete")
summer.index

Index(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios',
       'MALOKINIS, Ioannis', 'CHASAPIS, Spiridon', 'CHOROPHAS, Efstathios',
       'HAJOS, Alfred', 'ANDREOU, Joannis', 'CHOROPHAS, Efstathios',
       'NEUMANN, Paul',
       ...
       'AHMADOV, Emin', 'KAZAKEVIC, Aleksandr', 'KHUGAEV, Alan',
       'EBRAHIM, Karam Mohamed Gaber', 'GAJIYEV, Danyal', 'JANIKOWSKI, Damian',
       'REZAEI, Ghasem Gholamreza', 'TOTROV, Rustam', 'ALEKSANYAN, Artur',
       'LIDBERG, Jimmy'],
      dtype='object', name='Athlete', length=31165)

In [ ]:
# change our index back to a range index
# ******************************************************************************************
# drop = True - to drop the current index and create a new range index
# ******************************************************************************************
# inplace = True - to modify the original data frame (by default it is set to False and the method returns a new data frame)
# ******************************************************************************************
summer.reset_index(drop=False, inplace=True)

In [ ]:
summer.head()

,Athlete,Year,City,Sport,Discipline,Country,Gender,Event,Medal
0,"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1,"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
2,"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
3,"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
4,"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
# get the year column as the index
# ******************************************************************************************
# set_index() method - to set a column as the index
# ******************************************************************************************
# drop = True - to drop the current column and create a new index (default is set to True)
# drop = False - to keep the current column and create a new index (we have now two columns - the original column and the index)
# ******************************************************************************************
summer.set_index("Year", drop=True, inplace=True)

In [ ]:
summer.head()

,Athlete,City,Sport,Discipline,Country,Gender,Event,Medal
Year,,,,,,,,
1896,"HAJOS, Alfred",Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1896,"HERSCHMANN, Otto",Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
1896,"DRIVAS, Dimitrios",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
1896,"MALOKINIS, Ioannis",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
1896,"CHASAPIS, Spiridon",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
# as we have duplicated index labels, the parameter return as the False value
# ******************************************************************************************
summer.index.is_unique

False

In [ ]:
# change one element of the index
# ******************************************************************************************
# we cannot change the index label because it is immutable - we have to reset the index and set it again
# ******************************************************************************************
summer.index[0]

np.int64(1896)

In [ ]:
# But what we can do, we can pass a complete list or sequence that has exactly the same amount of elements as our index as the new index.
# summer.index.size - 31165
# so if we pass here a list with 31,165 elements, we can actually change the index label.
# ******************************************************************************************
new_index = ["Medall_No_{}".format(i) for i in range(1, summer.index.size + 1)]
new_index

['Medall_No_1',
 'Medall_No_2',
 'Medall_No_3',
 'Medall_No_4',
 'Medall_No_5',
 'Medall_No_6',
 'Medall_No_7',
 'Medall_No_8',
 'Medall_No_9',
 'Medall_No_10',
 'Medall_No_11',
 'Medall_No_12',
 'Medall_No_13',
 'Medall_No_14',
 'Medall_No_15',
 'Medall_No_16',
 'Medall_No_17',
 'Medall_No_18',
 'Medall_No_19',
 'Medall_No_20',
 'Medall_No_21',
 'Medall_No_22',
 'Medall_No_23',
 'Medall_No_24',
 'Medall_No_25',
 'Medall_No_26',
 'Medall_No_27',
 'Medall_No_28',
 'Medall_No_29',
 'Medall_No_30',
 'Medall_No_31',
 'Medall_No_32',
 'Medall_No_33',
 'Medall_No_34',
 'Medall_No_35',
 'Medall_No_36',
 'Medall_No_37',
 'Medall_No_38',
 'Medall_No_39',
 'Medall_No_40',
 'Medall_No_41',
 'Medall_No_42',
 'Medall_No_43',
 'Medall_No_44',
 'Medall_No_45',
 'Medall_No_46',
 'Medall_No_47',
 'Medall_No_48',
 'Medall_No_49',
 'Medall_No_50',
 'Medall_No_51',
 'Medall_No_52',
 'Medall_No_53',
 'Medall_No_54',
 'Medall_No_55',
 'Medall_No_56',
 'Medall_No_57',
 'Medall_No_58',
 'Medall_No_59',
 'Medall_No_60',
 'Medall_No_61',
 'Medall_No_62',
 'Medall_No_63',
 'Medall_No_64',
 'Medall_No_65',
 'Medall_No_66',
 'Medall_No_67',
 'Medall_No_68',
 'Medall_No_69',
 'Medall_No_70',
 'Medall_No_71',
 'Medall_No_72',
 'Medall_No_73',
 'Medall_No_74',
 'Medall_No_75',
 'Medall_No_76',
 'Medall_No_77',
 'Medall_No_78',
 'Medall_No_79',
 'Medall_No_80',
 'Medall_No_81',
 'Medall_No_82',
 'Medall_No_83',
 'Medall_No_84',
 'Medall_No_85',
 'Medall_No_86',
 'Medall_No_87',
 'Medall_No_88',
 'Medall_No_89',
 'Medall_No_90',
 'Medall_No_91',
 'Medall_No_92',
 'Medall_No_93',
 'Medall_No_94',
 'Medall_No_95',
 'Medall_No_96',
 'Medall_No_97',
 'Medall_No_98',
 'Medall_No_99',
 'Medall_No_100',
 'Medall_No_101',
 'Medall_No_102',
 'Medall_No_103',
 'Medall_No_104',
 'Medall_No_105',
 'Medall_No_106',
 'Medall_No_107',
 'Medall_No_108',
 'Medall_No_109',
 'Medall_No_110',
 'Medall_No_111',
 'Medall_No_112',
 'Medall_No_113',
 'Medall_No_114',
 'Medall_No_115',
 'Medall_No_116',
 'Medall_No_117',
 'Medall_No_118',
 'Medall_No_119',
 'Medall_No_120',
 'Medall_No_121',
 'Medall_No_122',
 'Medall_No_123',
 'Medall_No_124',
 'Medall_No_125',
 'Medall_No_126',
 'Medall_No_127',
 'Medall_No_128',
 'Medall_No_129',
 'Medall_No_130',
 'Medall_No_131',
 'Medall_No_132',
 'Medall_No_133',
 'Medall_No_134',
 'Medall_No_135',
 'Medall_No_136',
 'Medall_No_137',
 'Medall_No_138',
 'Medall_No_139',
 'Medall_No_140',
 'Medall_No_141',
 'Medall_No_142',
 'Medall_No_143',
 'Medall_No_144',
 'Medall_No_145',
 'Medall_No_146',
 'Medall_No_147',
 'Medall_No_148',
 'Medall_No_149',
 'Medall_No_150',
 'Medall_No_151',
 'Medall_No_152',
 'Medall_No_153',
 'Medall_No_154',
 'Medall_No_155',
 'Medall_No_156',
 'Medall_No_157',
 'Medall_No_158',
 'Medall_No_159',
 'Medall_No_160',
 'Medall_No_161',
 'Medall_No_162',
 'Medall_No_163',
 'Medall_No_164',
 'Medall_No_165',
 'Medall_No_166',
 'Medall_No_167',
 'Medall_No_168',
 'Medall_No_169',
 'Medall_No_170',
 'Medall_No_171',
 'Medall_No_172',
 'Medall_No_173',
 'Medall_No_174',
 'Medall_No_175',
 'Medall_No_176',
 'Medall_No_177',
 'Medall_No_178',
 'Medall_No_179',
 'Medall_No_180',
 'Medall_No_181',
 'Medall_No_182',
 'Medall_No_183',
 'Medall_No_184',
 'Medall_No_185',
 'Medall_No_186',
 'Medall_No_187',
 'Medall_No_188',
 'Medall_No_189',
 'Medall_No_190',
 'Medall_No_191',
 'Medall_No_192',
 'Medall_No_193',
 'Medall_No_194',
 'Medall_No_195',
 'Medall_No_196',
 'Medall_No_197',
 'Medall_No_198',
 'Medall_No_199',
 'Medall_No_200',
 'Medall_No_201',
 'Medall_No_202',
 'Medall_No_203',
 'Medall_No_204',
 'Medall_No_205',
 'Medall_No_206',
 'Medall_No_207',
 'Medall_No_208',
 'Medall_No_209',
 'Medall_No_210',
 'Medall_No_211',
 'Medall_No_212',
 'Medall_No_213',
 'Medall_No_214',
 'Medall_No_215',
 'Medall_No_216',
 'Medall_No_217',
 'Medall_No_218',
 'Medall_No_219',
 'Medall_No_220',
 'Medall_No_221',
 'Medall_No_222',
 'Medall_No_223',
 'Medall_No_224',
 'Medall_No_225',
 'Medall_No_226',
 'Medall_No_227',
 'Medall_No_228',
 'Medall_No_229',
 'Medall_No_230',
 'Medall_No_231',
 'Medall_No_232',
 'Medall_No_233',
 'Medall_No_234',
 'Medall_No_235',
 'Medall_No_236',
 'Medall_No_237',
 'Medall_No_238',
 'Medall_No_239',
 'Medall_No_240',
 'Medall_No_241',
 'Medall_No_242',
 'Medall_No_243',
 'Medall_No_244',
 'Medall_No_245',
 'Medall_No_246',
 'Medall_No_247',
 'Medall_No_248',
 'Medall_No_249',
 'Medall_No_250',
 'Medall_No_251',
 'Medall_No_252',
 'Medall_No_253',
 'Medall_No_254',
 'Medall_No_255',
 'Medall_No_256',
 'Medall_No_257',
 'Medall_No_258',
 'Medall_No_259',
 'Medall_No_260',
 'Medall_No_261',
 'Medall_No_262',
 'Medall_No_263',
 'Medall_No_264',
 'Medall_No_265',
 'Medall_No_266',
 'Medall_No_267',
 'Medall_No_268',
 'Medall_No_269',
 'Medall_No_270',
 'Medall_No_271',
 'Medall_No_272',
 'Medall_No_273',
 'Medall_No_274',
 'Medall_No_275',
 'Medall_No_276',
 'Medall_No_277',
 'Medall_No_278',
 'Medall_No_279',
 'Medall_No_280',
 'Medall_No_281',
 'Medall_No_282',
 'Medall_No_283',
 'Medall_No_284',
 'Medall_No_285',
 'Medall_No_286',
 'Medall_No_287',
 'Medall_No_288',
 'Medall_No_289',
 'Medall_No_290',
 'Medall_No_291',
 'Medall_No_292',
 'Medall_No_293',
 'Medall_No_294',
 'Medall_No_295',
 'Medall_No_296',
 'Medall_No_297',
 'Medall_No_298',
 'Medall_No_299',
 'Medall_No_300',
 'Medall_No_301',
 'Medall_No_302',
 'Medall_No_303',
 'Medall_No_304',
 'Medall_No_305',
 'Medall_No_306',
 'Medall_No_307',
 'Medall_No_308',
 'Medall_No_309',
 'Medall_No_310',
 'Medall_No_311',
 'Medall_No_312',
 'Medall_No_313',
 'Medall_No_314',
 'Medall_No_315',
 'Medall_No_316',
 'Medall_No_317',
 'Medall_No_318',
 'Medall_No_319',
 'Medall_No_320',
 'Medall_No_321',
 'Medall_No_322',
 'Medall_No_323',
 'Medall_No_324',
 'Medall_No_325',
 'Medall_No_326',
 'Medall_No_327',
 'Medall_No_328',
 'Medall_No_329',
 'Medall_No_330',
 'Medall_No_331',
 'Medall_No_332',
 'Medall_No_333',
 'Medall_No_334',
 'Medall_No_335',
 'Medall_No_336',
 'Medall_No_337',
 'Medall_No_338',
 'Medall_No_339',
 'Medall_No_340',
 'Medall_No_341',
 'Medall_No_342',
 'Medall_No_343',
 'Medall_No_344',
 'Medall_No_345',
 'Medall_No_346',
 'Medall_No_347',
 'Medall_No_348',
 'Medall_No_349',
 'Medall_No_350',
 'Medall_No_351',
 'Medall_No_352',
 'Medall_No_353',
 'Medall_No_354',
 'Medall_No_355',
 'Medall_No_356',
 'Medall_No_357',
 'Medall_No_358',
 'Medall_No_359',
 'Medall_No_360',
 'Medall_No_361',
 'Medall_No_362',
 'Medall_No_363',
 'Medall_No_364',
 'Medall_No_365',
 'Medall_No_366',
 'Medall_No_367',
 'Medall_No_368',
 'Medall_No_369',
 'Medall_No_370',
 'Medall_No_371',
 'Medall_No_372',
 'Medall_No_373',
 'Medall_No_374',
 'Medall_No_375',
 'Medall_No_376',
 'Medall_No_377',
 'Medall_No_378',
 'Medall_No_379',
 'Medall_No_380',
 'Medall_No_381',
 'Medall_No_382',
 'Medall_No_383',
 'Medall_No_384',
 'Medall_No_385',
 'Medall_No_386',
 'Medall_No_387',
 'Medall_No_388',
 'Medall_No_389',
 'Medall_No_390',
 'Medall_No_391',
 'Medall_No_392',
 'Medall_No_393',
 'Medall_No_394',
 'Medall_No_395',
 'Medall_No_396',
 'Medall_No_397',
 'Medall_No_398',
 'Medall_No_399',
 'Medall_No_400',
 'Medall_No_401',
 'Medall_No_402',
 'Medall_No_403',
 'Medall_No_404',
 'Medall_No_405',
 'Medall_No_406',
 'Medall_No_407',
 'Medall_No_408',
 'Medall_No_409',
 'Medall_No_410',
 'Medall_No_411',
 'Medall_No_412',
 'Medall_No_413',
 'Medall_No_414',
 'Medall_No_415',
 'Medall_No_416',
 'Medall_No_417',
 'Medall_No_418',
 'Medall_No_419',
 'Medall_No_420',
 'Medall_No_421',
 'Medall_No_422',
 'Medall_No_423',
 'Medall_No_424',
 'Medall_No_425',
 'Medall_No_426',
 'Medall_No_427',
 'Medall_No_428',
 'Medall_No_429',
 'Medall_No_430',
 'Medall_No_431',
 'Medall_No_432',
 'Medall_No_433',
 'Medall_No_434',
 'Medall_No_435',
 'Medall_No_436',
 'Medall_No_437',
 'Medall_No_438',
 'Medall_No_439',
 'Medall_No_440',
 'Medall_No_441',
 'Medall_No_442',
 'Medall_No_443',
 'Medall_No_444',
 'Medall_No_445',
 'Medall_No_446',
 'Medall_No_447',
 'Medall_No_448',
 'Medall_No_449',
 'Medall_No_450',
 'Medall_No_451',
 'Medall_No_452',
 'Medall_No_453',
 'Medall_No_454',
 'Medall_No_455',
 'Medall_No_456',
 'Medall_No_457',
 'Medall_No_458',
 'Medall_No_459',
 'Medall_No_460',
 'Medall_No_461',
 'Medall_No_462',
 'Medall_No_463',
 'Medall_No_464',
 'Medall_No_465',
 'Medall_No_466',
 'Medall_No_467',
 'Medall_No_468',
 'Medall_No_469',
 'Medall_No_470',
 'Medall_No_471',
 'Medall_No_472',
 'Medall_No_473',
 'Medall_No_474',
 'Medall_No_475',
 'Medall_No_476',
 'Medall_No_477',
 'Medall_No_478',
 'Medall_No_479',
 'Medall_No_480',
 'Medall_No_481',
 'Medall_No_482',
 'Medall_No_483',
 'Medall_No_484',
 'Medall_No_485',
 'Medall_No_486',
 'Medall_No_487',
 'Medall_No_488',
 'Medall_No_489',
 'Medall_No_490',
 'Medall_No_491',
 'Medall_No_492',
 'Medall_No_493',
 'Medall_No_494',
 'Medall_No_495',
 'Medall_No_496',
 'Medall_No_497',
 'Medall_No_498',
 'Medall_No_499',
 'Medall_No_500',
 'Medall_No_501',
 'Medall_No_502',
 'Medall_No_503',
 'Medall_No_504',
 'Medall_No_505',
 'Medall_No_506',
 'Medall_No_507',
 'Medall_No_508',
 'Medall_No_509',
 'Medall_No_510',
 'Medall_No_511',
 'Medall_No_512',
 'Medall_No_513',
 'Medall_No_514',
 'Medall_No_515',
 'Medall_No_516',
 'Medall_No_517',
 'Medall_No_518',
 'Medall_No_519',
 'Medall_No_520',
 'Medall_No_521',
 'Medall_No_522',
 'Medall_No_523',
 'Medall_No_524',
 'Medall_No_525',
 'Medall_No_526',
 'Medall_No_527',
 'Medall_No_528',
 'Medall_No_529',
 'Medall_No_530',
 'Medall_No_531',
 'Medall_No_532',
 'Medall_No_533',
 'Medall_No_534',
 'Medall_No_535',
 'Medall_No_536',
 'Medall_No_537',
 'Medall_No_538',
 'Medall_No_539',
 'Medall_No_540',
 'Medall_No_541',
 'Medall_No_542',
 'Medall_No_543',
 'Medall_No_544',
 'Medall_No_545',
 'Medall_No_546',
 'Medall_No_547',
 'Medall_No_548',
 'Medall_No_549',
 'Medall_No_550',
 'Medall_No_551',
 'Medall_No_552',
 'Medall_No_553',
 'Medall_No_554',
 'Medall_No_555',
 'Medall_No_556',
 'Medall_No_557',
 'Medall_No_558',
 'Medall_No_559',
 'Medall_No_560',
 'Medall_No_561',
 'Medall_No_562',
 'Medall_No_563',
 'Medall_No_564',
 'Medall_No_565',
 'Medall_No_566',
 'Medall_No_567',
 'Medall_No_568',
 'Medall_No_569',
 'Medall_No_570',
 'Medall_No_571',
 'Medall_No_572',
 'Medall_No_573',
 'Medall_No_574',
 'Medall_No_575',
 'Medall_No_576',
 'Medall_No_577',
 'Medall_No_578',
 'Medall_No_579',
 'Medall_No_580',
 'Medall_No_581',
 'Medall_No_582',
 'Medall_No_583',
 'Medall_No_584',
 'Medall_No_585',
 'Medall_No_586',
 'Medall_No_587',
 'Medall_No_588',
 'Medall_No_589',
 'Medall_No_590',
 'Medall_No_591',
 'Medall_No_592',
 'Medall_No_593',
 'Medall_No_594',
 'Medall_No_595',
 'Medall_No_596',
 'Medall_No_597',
 'Medall_No_598',
 'Medall_No_599',
 'Medall_No_600',
 'Medall_No_601',
 'Medall_No_602',
 'Medall_No_603',
 'Medall_No_604',
 'Medall_No_605',
 'Medall_No_606',
 'Medall_No_607',
 'Medall_No_608',
 'Medall_No_609',
 'Medall_No_610',
 'Medall_No_611',
 'Medall_No_612',
 'Medall_No_613',
 'Medall_No_614',
 'Medall_No_615',
 'Medall_No_616',
 'Medall_No_617',
 'Medall_No_618',
 'Medall_No_619',
 'Medall_No_620',
 'Medall_No_621',
 'Medall_No_622',
 'Medall_No_623',
 'Medall_No_624',
 'Medall_No_625',
 'Medall_No_626',
 'Medall_No_627',
 'Medall_No_628',
 'Medall_No_629',
 'Medall_No_630',
 'Medall_No_631',
 'Medall_No_632',
 'Medall_No_633',
 'Medall_No_634',
 'Medall_No_635',
 'Medall_No_636',
 'Medall_No_637',
 'Medall_No_638',
 'Medall_No_639',
 'Medall_No_640',
 'Medall_No_641',
 'Medall_No_642',
 'Medall_No_643',
 'Medall_No_644',
 'Medall_No_645',
 'Medall_No_646',
 'Medall_No_647',
 'Medall_No_648',
 'Medall_No_649',
 'Medall_No_650',
 'Medall_No_651',
 'Medall_No_652',
 'Medall_No_653',
 'Medall_No_654',
 'Medall_No_655',
 'Medall_No_656',
 'Medall_No_657',
 'Medall_No_658',
 'Medall_No_659',
 'Medall_No_660',
 'Medall_No_661',
 'Medall_No_662',
 'Medall_No_663',
 'Medall_No_664',
 'Medall_No_665',
 'Medall_No_666',
 'Medall_No_667',
 'Medall_No_668',
 'Medall_No_669',
 'Medall_No_670',
 'Medall_No_671',
 'Medall_No_672',
 'Medall_No_673',
 'Medall_No_674',
 'Medall_No_675',
 'Medall_No_676',
 'Medall_No_677',
 'Medall_No_678',
 'Medall_No_679',
 'Medall_No_680',
 'Medall_No_681',
 'Medall_No_682',
 'Medall_No_683',
 'Medall_No_684',
 'Medall_No_685',
 'Medall_No_686',
 'Medall_No_687',
 'Medall_No_688',
 'Medall_No_689',
 'Medall_No_690',
 'Medall_No_691',
 'Medall_No_692',
 'Medall_No_693',
 'Medall_No_694',
 'Medall_No_695',
 'Medall_No_696',
 'Medall_No_697',
 'Medall_No_698',
 'Medall_No_699',
 'Medall_No_700',
 'Medall_No_701',
 'Medall_No_702',
 'Medall_No_703',
 'Medall_No_704',
 'Medall_No_705',
 'Medall_No_706',
 'Medall_No_707',
 'Medall_No_708',
 'Medall_No_709',
 'Medall_No_710',
 'Medall_No_711',
 'Medall_No_712',
 'Medall_No_713',
 'Medall_No_714',
 'Medall_No_715',
 'Medall_No_716',
 'Medall_No_717',
 'Medall_No_718',
 'Medall_No_719',
 'Medall_No_720',
 'Medall_No_721',
 'Medall_No_722',
 'Medall_No_723',
 'Medall_No_724',
 'Medall_No_725',
 'Medall_No_726',
 'Medall_No_727',
 'Medall_No_728',
 'Medall_No_729',
 'Medall_No_730',
 'Medall_No_731',
 'Medall_No_732',
 'Medall_No_733',
 'Medall_No_734',
 'Medall_No_735',
 'Medall_No_736',
 'Medall_No_737',
 'Medall_No_738',
 'Medall_No_739',
 'Medall_No_740',
 'Medall_No_741',
 'Medall_No_742',
 'Medall_No_743',
 'Medall_No_744',
 'Medall_No_745',
 'Medall_No_746',
 'Medall_No_747',
 'Medall_No_748',
 'Medall_No_749',
 'Medall_No_750',
 'Medall_No_751',
 'Medall_No_752',
 'Medall_No_753',
 'Medall_No_754',
 'Medall_No_755',
 'Medall_No_756',
 'Medall_No_757',
 'Medall_No_758',
 'Medall_No_759',
 'Medall_No_760',
 'Medall_No_761',
 'Medall_No_762',
 'Medall_No_763',
 'Medall_No_764',
 'Medall_No_765',
 'Medall_No_766',
 'Medall_No_767',
 'Medall_No_768',
 'Medall_No_769',
 'Medall_No_770',
 'Medall_No_771',
 'Medall_No_772',
 'Medall_No_773',
 'Medall_No_774',
 'Medall_No_775',
 'Medall_No_776',
 'Medall_No_777',
 'Medall_No_778',
 'Medall_No_779',
 'Medall_No_780',
 'Medall_No_781',
 'Medall_No_782',
 'Medall_No_783',
 'Medall_No_784',
 'Medall_No_785',
 'Medall_No_786',
 'Medall_No_787',
 'Medall_No_788',
 'Medall_No_789',
 'Medall_No_790',
 'Medall_No_791',
 'Medall_No_792',
 'Medall_No_793',
 'Medall_No_794',
 'Medall_No_795',
 'Medall_No_796',
 'Medall_No_797',
 'Medall_No_798',
 'Medall_No_799',
 'Medall_No_800',
 'Medall_No_801',
 'Medall_No_802',
 'Medall_No_803',
 'Medall_No_804',
 'Medall_No_805',
 'Medall_No_806',
 'Medall_No_807',
 'Medall_No_808',
 'Medall_No_809',
 'Medall_No_810',
 'Medall_No_811',
 'Medall_No_812',
 'Medall_No_813',
 'Medall_No_814',
 'Medall_No_815',
 'Medall_No_816',
 'Medall_No_817',
 'Medall_No_818',
 'Medall_No_819',
 'Medall_No_820',
 'Medall_No_821',
 'Medall_No_822',
 'Medall_No_823',
 'Medall_No_824',
 'Medall_No_825',
 'Medall_No_826',
 'Medall_No_827',
 'Medall_No_828',
 'Medall_No_829',
 'Medall_No_830',
 'Medall_No_831',
 'Medall_No_832',
 'Medall_No_833',
 'Medall_No_834',
 'Medall_No_835',
 'Medall_No_836',
 'Medall_No_837',
 'Medall_No_838',
 'Medall_No_839',
 'Medall_No_840',
 'Medall_No_841',
 'Medall_No_842',
 'Medall_No_843',
 'Medall_No_844',
 'Medall_No_845',
 'Medall_No_846',
 'Medall_No_847',
 'Medall_No_848',
 'Medall_No_849',
 'Medall_No_850',
 'Medall_No_851',
 'Medall_No_852',
 'Medall_No_853',
 'Medall_No_854',
 'Medall_No_855',
 'Medall_No_856',
 'Medall_No_857',
 'Medall_No_858',
 'Medall_No_859',
 'Medall_No_860',
 'Medall_No_861',
 'Medall_No_862',
 'Medall_No_863',
 'Medall_No_864',
 'Medall_No_865',
 'Medall_No_866',
 'Medall_No_867',
 'Medall_No_868',
 'Medall_No_869',
 'Medall_No_870',
 'Medall_No_871',
 'Medall_No_872',
 'Medall_No_873',
 'Medall_No_874',
 'Medall_No_875',
 'Medall_No_876',
 'Medall_No_877',
 'Medall_No_878',
 'Medall_No_879',
 'Medall_No_880',
 'Medall_No_881',
 'Medall_No_882',
 'Medall_No_883',
 'Medall_No_884',
 'Medall_No_885',
 'Medall_No_886',
 'Medall_No_887',
 'Medall_No_888',
 'Medall_No_889',
 'Medall_No_890',
 'Medall_No_891',
 'Medall_No_892',
 'Medall_No_893',
 'Medall_No_894',
 'Medall_No_895',
 'Medall_No_896',
 'Medall_No_897',
 'Medall_No_898',
 'Medall_No_899',
 'Medall_No_900',
 'Medall_No_901',
 'Medall_No_902',
 'Medall_No_903',
 'Medall_No_904',
 'Medall_No_905',
 'Medall_No_906',
 'Medall_No_907',
 'Medall_No_908',
 'Medall_No_909',
 'Medall_No_910',
 'Medall_No_911',
 'Medall_No_912',
 'Medall_No_913',
 'Medall_No_914',
 'Medall_No_915',
 'Medall_No_916',
 'Medall_No_917',
 'Medall_No_918',
 'Medall_No_919',
 'Medall_No_920',
 'Medall_No_921',
 'Medall_No_922',
 'Medall_No_923',
 'Medall_No_924',
 'Medall_No_925',
 'Medall_No_926',
 'Medall_No_927',
 'Medall_No_928',
 'Medall_No_929',
 'Medall_No_930',
 'Medall_No_931',
 'Medall_No_932',
 'Medall_No_933',
 'Medall_No_934',
 'Medall_No_935',
 'Medall_No_936',
 'Medall_No_937',
 'Medall_No_938',
 'Medall_No_939',
 'Medall_No_940',
 'Medall_No_941',
 'Medall_No_942',
 'Medall_No_943',
 'Medall_No_944',
 'Medall_No_945',
 'Medall_No_946',
 'Medall_No_947',
 'Medall_No_948',
 'Medall_No_949',
 'Medall_No_950',
 'Medall_No_951',
 'Medall_No_952',
 'Medall_No_953',
 'Medall_No_954',
 'Medall_No_955',
 'Medall_No_956',
 'Medall_No_957',
 'Medall_No_958',
 'Medall_No_959',
 'Medall_No_960',
 'Medall_No_961',
 'Medall_No_962',
 'Medall_No_963',
 'Medall_No_964',
 'Medall_No_965',
 'Medall_No_966',
 'Medall_No_967',
 'Medall_No_968',
 'Medall_No_969',
 'Medall_No_970',
 'Medall_No_971',
 'Medall_No_972',
 'Medall_No_973',
 'Medall_No_974',
 'Medall_No_975',
 'Medall_No_976',
 'Medall_No_977',
 'Medall_No_978',
 'Medall_No_979',
 'Medall_No_980',
 'Medall_No_981',
 'Medall_No_982',
 'Medall_No_983',
 'Medall_No_984',
 'Medall_No_985',
 'Medall_No_986',
 'Medall_No_987',
 'Medall_No_988',
 'Medall_No_989',
 'Medall_No_990',
 'Medall_No_991',
 'Medall_No_992',
 'Medall_No_993',
 'Medall_No_994',
 'Medall_No_995',
 'Medall_No_996',
 'Medall_No_997',
 'Medall_No_998',
 'Medall_No_999',
 'Medall_No_1000',
 ...]

In [ ]:
# we have set the new index labels
# ******************************************************************************************
summer.index = new_index
summer.head()

,Athlete,City,Sport,Discipline,Country,Gender,Event,Medal
Medall_No_1,"HAJOS, Alfred",Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
Medall_No_2,"HERSCHMANN, Otto",Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
Medall_No_3,"DRIVAS, Dimitrios",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
Medall_No_4,"MALOKINIS, Ioannis",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
Medall_No_5,"CHASAPIS, Spiridon",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
summer.tail()

,Athlete,City,Sport,Discipline,Country,Gender,Event,Medal
Medall_No_31161,"JANIKOWSKI, Damian",London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
Medall_No_31162,"REZAEI, Ghasem Gholamreza",London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
Medall_No_31163,"TOTROV, Rustam",London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
Medall_No_31164,"ALEKSANYAN, Artur",London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
Medall_No_31165,"LIDBERG, Jimmy",London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze

In [ ]:
summer.index.is_unique

True

In [ ]:
# give a name to the index
# ******************************************************************************************
summer.index.name = "Medal_No"
summer.head()

,Athlete,City,Sport,Discipline,Country,Gender,Event,Medal
Medal_No,,,,,,,,
Medall_No_1,"HAJOS, Alfred",Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
Medall_No_2,"HERSCHMANN, Otto",Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
Medall_No_3,"DRIVAS, Dimitrios",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
Medall_No_4,"MALOKINIS, Ioannis",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
Medall_No_5,"CHASAPIS, Spiridon",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
# reset our index to a range index
# ******************************************************************************************
# the index we have before is now a column
# ******************************************************************************************
summer.reset_index()

,Medal_No,Athlete,City,Sport,Discipline,Country,Gender,Event,Medal
0,Medall_No_1,"HAJOS, Alfred",Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1,Medall_No_2,"HERSCHMANN, Otto",Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
2,Medall_No_3,"DRIVAS, Dimitrios",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
3,Medall_No_4,"MALOKINIS, Ioannis",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
4,Medall_No_5,"CHASAPIS, Spiridon",Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31160,Medall_No_31161,"JANIKOWSKI, Damian",London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
31161,Medall_No_31162,"REZAEI, Ghasem Gholamreza",London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
31162,Medall_No_31163,"TOTROV, Rustam",London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
31163,Medall_No_31164,"ALEKSANYAN, Artur",London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
31164,Medall_No_31165,"LIDBERG, Jimmy",London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze

##### Changing Column Labels

In [ ]:
import pandas as pd
titanic = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\titanic.csv")
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [ ]:
titanic.columns[0], titanic.columns

('survived',
 Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
        'embarked', 'deck'],
       dtype='object'))

In [ ]:
# Also, column index objects are immutable, so we can only change them the whole index by passing a
# list or a sequence with new values that has actually the same amount of elements than our index.
# ******************************************************************************************
# titanic.columns[0] ="Alive" - TypeError: Index does not support mutable operations
# ******************************************************************************************
titanic.columns = ["Alive", "Class","Sex","Age","SipSp","ParCh","Fare","Emb","Deck"]
titanic.head()

   Alive  Class     Sex   Age  SipSp  ParCh     Fare Emb Deck
0      0      3    male  22.0      1      0   7.2500   S  NaN
1      1      1  female  38.0      1      0  71.2833   C    C
2      1      3  female  26.0      0      0   7.9250   S  NaN
3      1      1  female  35.0      1      0  53.1000   S    C
4      0      3    male  35.0      0      0   8.0500   S  NaN

In [ ]:
titanic.columns.name

In [ ]:
# And we can also set a name for our column index object. So there's the attribute name.
# ******************************************************************************************
titanic.columns.name = "Pass_Charact"
titanic.head()

Pass_Charact  Alive  Class     Sex   Age  SipSp  ParCh     Fare Emb Deck
0                 0      3    male  22.0      1      0   7.2500   S  NaN
1                 1      1  female  38.0      1      0  71.2833   C    C
2                 1      3  female  26.0      0      0   7.9250   S  NaN
3                 1      1  female  35.0      1      0  53.1000   S    C
4                 0      3    male  35.0      0      0   8.0500   S  NaN

In [ ]:
titanic.index.name = "Passenger_No"
titanic.head()
# ******************************************************************************************
# So now we have here a name for our column labels.
# So passenger characteristics. And we have a name for our row index passenger number.
# ******************************************************************************************

Pass_Charact  Alive  Class     Sex   Age  SipSp  ParCh     Fare Emb Deck
Passenger_No
0                 0      3    male  22.0      1      0   7.2500   S  NaN
1                 1      1  female  38.0      1      0  71.2833   C    C
2                 1      3  female  26.0      0      0   7.9250   S  NaN
3                 1      1  female  35.0      1      0  53.1000   S    C
4                 0      3    male  35.0      0      0   8.0500   S  NaN

##### Renaming Index & Column Labels with rename()

In [ ]:
summer = pd.read_csv(r"C:\Users\aitor\OneDrive\Desktop\FRED\course_env\Pandas_2025\onthego_materials\Course_Materials_Part1\Video_Lecture_NBs\summer.csv", index_col="Athlete")
summer

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...
"JANIKOWSKI, Damian",2012,London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
"REZAEI, Ghasem Gholamreza",2012,London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
"TOTROV, Rustam",2012,London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
"ALEKSANYAN, Artur",2012,London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
"LIDBERG, Jimmy",2012,London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze

In [ ]:
# let's assume that HAJOS, Alfred should be HAYOS, Alfred
# ******************************************************************************************
# pandas index objects are immutable, so we cannot change a single index label
# summer.index[0] = "HAYOS, Alfred" - TypeError: Index does not support mutable operations
# ******************************************************************************************
# 2 ways of using rename method
# ******************************************************************************************

In [ ]:
# ******************************************************************************************
# mapper parameter - to change a single index label - pass a dictionary with the old and new index labels
# ******************************************************************************************
summer.rename(mapper={"HAJOS, Alfred":"HAYOS, Alfred"}, axis="index")

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAYOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...
"JANIKOWSKI, Damian",2012,London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
"REZAEI, Ghasem Gholamreza",2012,London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
"TOTROV, Rustam",2012,London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
"ALEKSANYAN, Artur",2012,London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
"LIDBERG, Jimmy",2012,London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze

In [ ]:
# ******************************************************************************************
# index parameter - pass a dictionary with the old and new index labels
# ******************************************************************************************
# choose the inplace parameter if you wish to modify the original data frame
# ******************************************************************************************
summer.rename(index={"HAJOS, Alfred":"HAYOS, Alfred"})

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAYOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...
"JANIKOWSKI, Damian",2012,London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
"REZAEI, Ghasem Gholamreza",2012,London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
"TOTROV, Rustam",2012,London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
"ALEKSANYAN, Artur",2012,London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
"LIDBERG, Jimmy",2012,London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze

In [ ]:
# change the column labels
# ******************************************************************************************
# 2 ways of using rename method - (mapper parameter and columns parameter)
# ******************************************************************************************
summer.rename(mapper={"Sex":"Gender", "City": "Host_City"}, axis="columns")

,Year,Host_City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...
"JANIKOWSKI, Damian",2012,London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
"REZAEI, Ghasem Gholamreza",2012,London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
"TOTROV, Rustam",2012,London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
"ALEKSANYAN, Artur",2012,London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
"LIDBERG, Jimmy",2012,London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze

In [ ]:
summer.rename(columns={"Sex":"Gender", "City": "Host_City"})
# ******************************************************************************************
# choose the inplace parameter if you wish to modify the original data frame
# ******************************************************************************************

,Year,Host_City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...
"JANIKOWSKI, Damian",2012,London,Wrestling,Wrestling Freestyle,POL,Men,Wg 84 KG,Bronze
"REZAEI, Ghasem Gholamreza",2012,London,Wrestling,Wrestling Freestyle,IRI,Men,Wg 96 KG,Gold
"TOTROV, Rustam",2012,London,Wrestling,Wrestling Freestyle,RUS,Men,Wg 96 KG,Silver
"ALEKSANYAN, Artur",2012,London,Wrestling,Wrestling Freestyle,ARM,Men,Wg 96 KG,Bronze
"LIDBERG, Jimmy",2012,London,Wrestling,Wrestling Freestyle,SWE,Men,Wg 96 KG,Bronze

##### Coding exercise - 04 (separate nb)